//------------------------------------------------------------------------------
// ball_In.cpp - содержит процедуру ввода параметров
// для уже созданного шара
//------------------------------------------------------------------------------

#include "math.h"
#include "ball.h"

//------------------------------------------------------------------------------
// Ввод параметров шара из файла
void In(ball &b, ifstream &ifst) {
    ifst >> b.r >> b.materialDensity;
}

// Случайный ввод параметров шара
void InRnd(ball &b) {
    b.r = Random();
    b.materialDensity = Random();
}

//------------------------------------------------------------------------------
// Вывод параметров шара в форматируемый поток
void Out(ball &b, ofstream &ofst) {
    ofst << "It is Ball: r = " << b.r << ". Material density = " << b.materialDensity
         << ". Square = " << Square(b) << "\n";
}

//------------------------------------------------------------------------------
// Вычисление площади поверхности шара
double Square(ball &b) {
    return 4.0 * M_PI * (b.r * b.r);
}
