//------------------------------------------------------------------------------
// parallelepiped_In.cpp - содержит процедуру ввода параметров
// для уже созданного прямоугольника
//------------------------------------------------------------------------------

#include "parallelepiped.h"

//------------------------------------------------------------------------------
// Ввод параметров прямоугольника из файла
void In(parallelepiped &p, ifstream &ifst) {
    ifst >> p.x >> p.y >> p.z >> p.materialDensity;
}

// Случайный ввод параметров прямоугольника
void InRnd(parallelepiped &p) {
    p.x = Random();
    p.y = Random();
    p.z = Random();
    p.materialDensity = Random();
}

//------------------------------------------------------------------------------
// Вывод параметров прямоугольника в форматируемый поток
void Out(parallelepiped &p, ofstream &ofst) {
    ofst << "It is Parallelepiped: x = " << p.x << ", y = " << p.y
         << ", z = " << p.z << ". Material density = " << p.materialDensity
         << ". Square = " << Square(p) << "\n";
}

//------------------------------------------------------------------------------
// Вычисление периметра прямоугольника
double Square(parallelepiped &p) {
    return 2.0 * (p.x * p.y + p.y * p.z + p.x * p.z);
}
